Revit 2026 API

# MassInstanceUtilsRemoveMassLevelDataFromMassInstance Method

---

Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RemoveMassLevelDataFromMassInstance(
	Document document,
	ElementId massInstanceId,
	ElementId levelId
)
```
```vb
Public Shared Sub RemoveMassLevelDataFromMassInstance (
	document As Document,
	massInstanceId As ElementId,
	levelId As ElementId
)
```
```cpp
public:
static void RemoveMassLevelDataFromMassInstance(
	Document^ document,
	ElementId^ massInstanceId,
	ElementId^ levelId
)
```
```fsharp
static member RemoveMassLevelDataFromMassInstance :
        document : Document *
        massInstanceId : ElementId *
        levelId : ElementId -> unit
```

#### Parameters

document Document
     The Document.
massInstanceId ElementId
     The ElementId of the mass instance.
levelId ElementId
     The ElementId of the Level to disassociate from the mass instance.

| Exception | Condition |
| --- | --- |
| ArgumentException | The ElementId massInstanceId is not a mass instance. -or- The ElementId levelId is not a Level. |
| ArgumentNullException | A non-optional argument was null |

Alternatively, you could just delete the MassLevelData.

#### Reference

MassInstanceUtils Class

Autodesk.Revit.DB Namespace